{
  "tags": [
    {
      "decimal_fraction": {
        "related_tags": [
          "practical_math",
          "number_and_magnitude",
          "arithmetics"
        ]
      },
      "logarithm": {
        "related_tags": [
          "practical_math",
          "precomputed_tables"
        ],
        "details": [
          "By large, logarithms simplify calculations because adding/subtracting is often easier than multiplying/dividing. Since log(mn) = log(m) + log(n) (or alternatively, a^ma^n = a^(m+n))."
        ]
      },
      "kinematic_model": {
        "related_tags": [
          "number_and_magnitude",
          "precalculus",
          "ratio_theory",
          "curves"
        ],
        "details": [
          "Kinematic ideas appeared frequently in mathematics of the first half of the 17th century.",
          "They provide clear and visualizable means for the generation of geometric magnitude.",
          "The conception of a curve traced by a particle moving through space later played a significant role in the development of calculus. This idea is also apparent in some renderings of the Elements, such as Clavius' or Billingsley's (Mallet, 2006).",
          "The Elements' ratio theory offered a way to express the different relationships among the quantities linked to moving bodies"
        ],
        "sources": [
          "https://www.britannica.com/science/mathematics/Mathematics-in-the-17th-and-18th-centuries",
          "https://www.britannica.com/science/mathematics/Omar-Khayyam#ref65996",
          "Mallet, A.` (2006). Renaissance notions of number and magnitude. Historia Mathematica, 33(1), 63–81. https://doi.org/10.1016/j.hm.2004.11.011"
        ]
      },
      "precomputed_tables": {
        "related_tags": [
          "practical_math",
          "logarithms"
        ],
        "details": [
          "Denniss's (2006) discusses Ready tables and reckoners as a mathematical trend. He notes the prevalence of pre-calculated results, which were sometimes included in books, and in some cases, the entire book consisted solely of tables."
        ],
        "sources": [
          "Denniss, J. (2006). Arithmetical textbooks 1478 to 1886: A progression? BSHM Bulletin: Journal of the British Society for the History of Mathematics, 21(1), 26–33. https://doi.org/10.1080/17498430600566550"
        ]
      },
      "curves": {
        "related_tags": [
          "analytic_geometry",
          "views_on_antiquity",
          "precalculus",
          "kinematic_model"
        ],
        "details": [
          "The conception of a curve traced by a particle moving through space later played a significant role in the development of calculus.",
          "According to \"Mathematics in the 17th and 18th centuries\" (Britannica), The increased interest in curves can be partially attributed to:\n(a) The recovery and Latin translation of the classical treatises of Apollonius, Archimedes, and Pappus.\n(b) The increasing importance of curves in applied fields such as astronomy, mechanics, optics, and stereometry.",
          "During the 17th century, more curves that could not be generated by a point moving through space were \"discussed\". Examples include the cycloid, Galileo's parabolic trajectory and de Roberval's research (trochoid)."
        ],
        "sources": [
          "https://www.britannica.com/science/mathematics/Mathematics-in-the-17th-and-18th-centuries"
        ]
      },
      "number_and_magnitude": {
        "details": [
          "In in Euclidean geometry there is a distinction between magnitude, which is continuous, and number, which is a multitude of indivisible units",
          "As far as we know, the separate conception of number and magnitude was preserved in the middle ages Latin translation of the Elements and was taught in major schools in the first half of the 15th century.",
          "In the 16th century Cardano, Bombelli, Stevin, and others confronted this distinction.",
          "The distinction was largely gone by the second half of the 17th century.",
          "Malet (2006) argues that The conceptual shift came to the Latin West mostly by way of the applied mathematics taught in abacus schools and explained in abacus manuscripts."
        ],
        "sources": [
          "Renaissance notions of number and magnitude. (2006). Historia Mathematica, 33(1), 63–81. https://doi.org/10.1016/j.hm.2004.11.011",
          "https://www.britannica.com/science/mathematics/Mathematics-in-the-17th-and-18th-centuries"
        ]
      },
      "roots": {
        "related_tags": [
          "number_and_magnitude",
          "practical_math"
        ],
        "details": [
          "Roots were sometimes classified as being \"absurd\", \"less perfect\" or \"inexpressible.\""
        ],
        "sources": [
          "Renaissance notions of number and magnitude. (2006). Historia Mathematica, 33(1), 63–81. https://doi.org/10.1016/j.hm.2004.11.011"
        ]
      },
      "independent_invention": {
        "details": [
          "This tag refers both to independent discovery and independent invention."
        ]
      }
    }
  ]
}